In [1]:
# Dropna
import pandas as pd

In [53]:
df = pd.read_csv(r'C:\Users\Satyam\Downloads\Bengaluru_House_Data.csv')

In [3]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [4]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5501
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [8]:
df['society'].isnull().sum()

5501

In [11]:
df['society'].dropna(axis = 0)

0        Coomee
1        Theanmp
2         @@@@@@
3        Soiewre
5        DuenaTa
          ...
13313    Aklia R
13314    SoosePr
13315    ArsiaEx
13317    Mahla T
13318    SollyCl
Name: society, Length: 7819, dtype: object

In [12]:
df['society'].isnull().sum()

5501

In [16]:
df.dropna(axis = 1)

                  area_type   availability total_sqft   price
0      Super built-up  Area         19-Dec       1056   39.07
1                Plot  Area  Ready To Move       2600  120.00
2            Built-up  Area  Ready To Move       1440   62.00
3      Super built-up  Area  Ready To Move       1521   95.00
4      Super built-up  Area  Ready To Move       1200   51.00
...                     ...            ...        ...     ...
13315        Built-up  Area  Ready To Move       3453  231.00
13316  Super built-up  Area  Ready To Move       3600  400.00
13317        Built-up  Area  Ready To Move       1141   60.00
13318  Super built-up  Area         18-Jun       4689  488.00
13319  Super built-up  Area  Ready To Move        550   17.00

[13320 rows x 4 columns]

In [17]:
#wap to use drop na on a single col.
df.dropna(subset=['society'],inplace=True)

In [18]:
df['society'].isnull().sum()

0

In [20]:
df['society'].isnull().sum()

5501

In [24]:
df.dropna(axis = 0,how = 'any',inplace = True)

In [25]:
df.isnull().sum()

area_type       0
availability    0
location        0
size            0
society         0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [27]:
df.dropna(subset = ['society'])

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
...,...,...,...,...,...,...,...,...,...
13313,Super built-up Area,Ready To Move,Uttarahalli,3 BHK,Aklia R,1345,2.0,1.0,57.00
13314,Super built-up Area,Ready To Move,Green Glen Layout,3 BHK,SoosePr,1715,3.0,3.0,112.00
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00

In [28]:
df['society'].isnull().sum()

0

In [29]:
# replace
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00

In [45]:
# wap to find the mode of the society.
x = df['society'].mode()

In [43]:
# replace ------> repalce 1 with 67
df['area_type'].replace(to_replace ='Super built-up  Area',value = 'Delhi')

0                 Delhi
1            Plot  Area
2        Built-up  Area
3                 Delhi
4                 Delhi
              ...
13315    Built-up  Area
13316             Delhi
13317    Built-up  Area
13318             Delhi
13319             Delhi
Name: area_type, Length: 13320, dtype: object

In [33]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00

In [34]:
s = pd.Series([0, 1, 2, 3, 4])

In [35]:
s.replace(to_replace=3,value = 56)

0     0
1     1
2     2
3    56
4     4
dtype: int64

In [54]:
# society -----> @@@
# replace ------> mode of society.

df['society'] = df['society'].replace('@@@@@@',x[0],inplace = True)

In [55]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,None,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,None,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,None,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,None,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,None,1200,2.0,1.0,51.00

In [56]:
df['society'].unique()

array([None], dtype=object)

In [57]:
# update the value of replace value

In [58]:
# join
# append
# merge
# concate
# groupby
# replace

# concate----->\

a = '1'
b = '2'
c = a+b
c

'12'

In [84]:
# merge
d1 ={
    'name':['abc','bcd','gfh','mno'],
    'class':[1,2,3,4],
    'age': [5,6,7,8],
    'hobby':['xyz','a','b','c']
}

In [94]:
d2 = {
    'hobby':['music'],
    'age': [45],
    'marks':[78]
    
}

In [95]:
df1 = pd.DataFrame(d1)

In [96]:
df1

  name  class  age hobby
0  abc      1    5   xyz
1  bcd      2    6     a
2  gfh      3    7     b
3  mno      4    8     c

In [97]:
df2 = pd.DataFrame(d2)

In [98]:
df2

   hobby  age  marks
0  music   45     78

In [99]:
m = pd.merge(df1,df2,how = 'right')

In [100]:
m

  name  class  age  hobby  marks
0  NaN    NaN   45  music     78

In [101]:
m = pd.merge(df1,df2,how = 'left')

In [102]:
m

  name  class  age hobby  marks
0  abc      1    5   xyz    NaN
1  bcd      2    6     a    NaN
2  gfh      3    7     b    NaN
3  mno      4    8     c    NaN

In [103]:
m = pd.merge(df1,df2,how = 'inner')

In [104]:
m

Empty DataFrame
Columns: [name, class, age, hobby, marks]
Index: []

In [105]:
m = pd.merge(df1,df2,how = 'outer')

In [106]:
m

  name  class  age  hobby  marks
0  abc    1.0    5    xyz    NaN
1  bcd    2.0    6      a    NaN
2  gfh    3.0    7      b    NaN
3  mno    4.0    8      c    NaN
4  NaN    NaN   45  music   78.0